<!-- connectdb.php -->
<?php
    // 1. กำหนดตัวแปรสำหรับข้อมูลการเชื่อมต่อฐานข้อมูล
    $host = "localhost";  // ตัวแปรนี้เก็บชื่อโฮสต์ (ปกติคือ "localhost" ถ้าฐานข้อมูลอยู่ในเครื่องเดียวกันกับเซิร์ฟเวอร์ PHP)
    $user = "root";       // ตัวแปรนี้เก็บชื่อผู้ใช้สำหรับการเข้าถึงฐานข้อมูล (ปกติจะใช้ "root" เป็นค่าเริ่มต้น)
    $pass = "";           // ตัวแปรนี้เก็บรหัสผ่านสำหรับผู้ใช้ (ถ้าไม่ได้ตั้งรหัสผ่านก็จะปล่อยให้เป็นค่าว่าง)
    $dbname = "logindb";  // ตัวแปรนี้เก็บชื่อฐานข้อมูลที่จะเชื่อมต่อ (ในที่นี้คือฐานข้อมูลที่ชื่อว่า "logindb")
    
    // 2. การสร้างการเชื่อมต่อกับฐานข้อมูลโดยใช้ mysqli
    $conn = new mysqli($host, $user, $pass, $dbname);  // ฟังก์ชันนี้จะพยายามเชื่อมต่อกับฐานข้อมูลโดยใช้ตัวแปรที่กำหนดไว้ด้านบน
    
    // 3. ตรวจสอบว่าการเชื่อมต่อสำเร็จหรือไม่
    if($conn->connect_error) {  // ฟังก์ชันนี้ใช้ตรวจสอบว่าการเชื่อมต่อกับฐานข้อมูลเกิดข้อผิดพลาดหรือไม่
        die("Cannot connect database!!");  // ถ้ามีข้อผิดพลาด จะหยุดการทำงานของโปรแกรมและแสดงข้อความ "Cannot connect database!!"
    }
?>
